# 5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает
# фирма (прибыль — выручка больше издержек,
# или убыток — издержки больше выручки). Выведите соответствующее сообщение. Если фирма отработала с прибылью, вычислите
# рентабельность выручки (соотношение прибыли
# к выручке). Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

proceeds = float(input("Введи выручку: "))
costs = float(input("Введи издержки: "))

if proceeds < costs:
    print("Фирма работает в УБЫТОК!")
elif proceeds == costs:
    print("Фирма работает в ноль")
elif proceeds > costs:
    profit = (proceeds-costs)/proceeds
    print(f"Рентабельность фирмы составляет {profit:.2%}")
    staff = int(input("Введи число сотрудников: "))
    pro_staff = (proceeds-costs)/staff
    print(f"Прибыль на сотрудника = {pro_staff:.2f}")
