"""1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия. Для выполнения расчета
для конкретных значений необходимо запускать скрипт с параметрами."""

from sys import argv

param = argv
if not len(param) == 4:
    print("Введены не все параметры!")
    print("Пример:\nTask_01.py [часы] [ставка] [премия]")
else:
    if not param[1].isdigit() or not param[2].isdigit() or not param[3].isdigit():
        print("Один из параметров введен не верно!")
    else:
        print(f"ЗП сотрудника - {float(param[1])*float(param[2])+float(param[3])} $")
