# 6. * Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж хранит
# информацию об отдельном товаре.
# В кортеже должно быть два элемента — номер товара и словарь с параметрами (характеристиками товара: название, цена,
# количество, единица измерения).
#  Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
# Пример готовой структуры:
# [
# (1, {"название": "компьютер", "цена": 20000, "количество": 5, "eд": "шт."}),
# (2, {"название": "принтер", "цена": 6000, "количество": 2, "eд": "шт."}),
# (3, {"название": "сканер", "цена": 2000, "количество": 7, "eд": "шт."})
# ]
# Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара, например
# название,
# а значение — список значений-характеристик, например список названий товаров.
# Пример:
# {
# "название": ["компьютер", "принтер", "сканер"],
# "цена": [20000, 6000, 2000],
# "количество": [5, 2, 7],
# "ед": ["шт.","шт.""шт."]
# }

shop_base = list()
print("Меню")
while True:
    print("""
        1. Создать новый товар
        2. Просмотреть товары
        3. Вывести аналитику
        4. Выйти из программы
    """)
    action = int(input("Выбери действие: "))
    if action == 1:
        new_good = input("Введи название, цену, количетво, ед. измерения через (; ): ").split('; ')
        shop_base.append((len(shop_base), {"название": new_good[0], "цена": new_good[1], "количество": new_good[2],
                                                "ед": new_good[3]}))
    elif action == 2:
        for i, item in enumerate(shop_base):
            print(f"{i+1}. {item}")
    elif action == 3:
        name = list()
        price = list()
        count = list()
        unit = list()

        for good in shop_base:
            name.append(good[1].get("название", 'нет инф.'))
            price.append(good[1].get("цена", 'нет инф.'))
            count.append(good[1].get("количество", 'нет инф.'))
            unit.append(good[1].get("ед", 'нет инф.'))

        report = {"название": name, "цена": price, "количество": count, "ед": unit}
        print(report)
    else:
        break

