"""5. Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии Enter
должна выводиться сумма чисел. Пользователь может продолжить ввод чисел, разделенных пробелом и снова
нажать Enter. Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа
вводится специальный символ, выполнение программы завершается. Если специальный символ введен после нескольких
чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу."""


global_sum = 0
global_do = True

def get_sum(digit_list):
    """суммируем список и увеличиваем глобальную сумму"""
    global global_sum
    tmp_sum = sum(digit_list)
    global_sum += tmp_sum
    return tmp_sum


def do_sum(input_list):
    """проверка на НЕ числа, если такие есть, то удаляем.
    если встречается символ завершения, то выходим из программы"""

    for i, item in enumerate(input_list):
        global global_do
        try:
            input_list[i] = int(item)
        except ValueError:
            if item == "q":
                global_do = False
            input_list[i] = 0

    return get_sum(input_list)


while global_do:
    result = do_sum(input("Введи числа через пробел. Для завершения расчета введи \"q\": ").split(" "))
    print(f"{result}({global_sum})")




