# 2. Для списка реализовать обмен значений соседних элементов, т.е. Значениями обмениваются элементы
# с индексами 0 и 1, 2 и 3 и т.д.
#  При нечетном количестве элементов последний сохранить на своем месте. Для заполнения списка элементов
#  необходимо использовать функцию input().

list_a = input("Введи элементы списка через пробел: ").split(" ")
print("")
print(f"Cписок до изменений: {list_a}")

y = 0
while len(list_a) > y:
    if (y + 1) >= len(list_a):
        break
    list_a[y], list_a[y + 1] = list_a[y + 1], list_a[y]
    y += 2

print(f"Cписок после изменений: {list_a}")
