# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def my_func(a, b):
    if b == 0:
        return "Деление на ноль!"
    if a.isdigit() and b.isdigit():
        c = int(a)/int(b)
        return c
    else:
        return "Введено не чило!"


math = input("Введи два числа через пробел: ").split()
print(my_func(math[0], math[1]))
