"""4. Программа принимает действительное положительное число x и целое отрицательное число y. Необходимо
выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
При решении задания необходимо обойтись без встроенной функции возведения числа в степень.

Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
"""


def my_func_v1(x, y):
    return round(x**y, 4)


def my_func_v2(x, y):
    z = 1
    for _ in range(abs(y)):
        z = z * x

    return round(1/z, 4)


go = True
while go:
    try:
        x = float(input("Введи действительное положительное число: "))
    except ValueError:
        print("Ошибка! Введено не число")
    else:
        if x > 0:
            go = False
        else:
            print("Ошибка! Число отрицательное или равно 0")

go = True
while go:
    try:
        y = int(input("Введи целое отрицательное число: "))
    except ValueError:
        print("Ошибка! Введено не число или не целое число")
    else:
        if y < 0:
            go = False
        else:
            print("Ошибка! Число положительное или равно 0")

print(f"\nРезультат работы 1й функции - {my_func_v1(x, y)}")
print(f"Результат работы 2й функции - {my_func_v2(x, y)}")
