# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится
# месяц (зима, весна, лето, осень).
#  Напишите решения через list и через dict.

month_number = int(input("Введи номер месяца: "))

seasons_list = ("Зима", "Весна", "Лето", "Осень")
month_dic = {(12, 1, 2): 0,
             (3, 4, 5): 1,
             (6, 7, 8): 2,
             (9, 10, 11): 3}

for key, item in month_dic.items():
    if month_number in key:
        print(f"Сезон - {seasons_list[item]}")
        break
