# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
#  Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен
#  разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

my_list = [7, 5, 3, 3, 2]
stop = False
while stop is False:
    digit = input("Введи целое чило (для остановки нажмите ENTER): ")

    if digit == '':
        stop = True
        break

    digit = float(digit)
    if digit in my_list:  # если такое число есть, то вставим новое значение правее
        my_list.insert(my_list.index(digit)+my_list.count(digit), digit)
        continue
    else:  # если такого числа нет, то вставим его в список и отсортируем список по убыванию
        my_list.append(digit)
        for i in range(len(my_list)):
            for k in range(len(my_list)-1):
                if my_list[k] < my_list[k+1]:
                    my_list[k], my_list[k + 1] = my_list[k + 1], my_list[k]

print(my_list)
