# 2. Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.

t = int(input("Введи время в секундах:"))

hh = t // 3600
mm = (t % 3600) // 60
ss = (t % 3600) % 60

print(f'{hh:02}:{mm:02}:{ss:02}')
