"""
5. Реализовать формирование списка, используя функцию range() и возможности генератора. В список должны войти
 четные числа от 100 до 1000 (включая границы). Необходимо получить результат вычисления произведения всех элементов
 списка.

Подсказка: использовать функцию reduce().
"""

from functools import reduce

list_a = [_ for _ in range(100, 1001)[0::2]]
print(reduce(lambda i, j: i*j, list_a))

