# 1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа
# данных каждого элемента.
#  Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя,
#  а указать явно, в программе.
#

list_a = [1, 45, 4.5, "a", 0x12, True]

i = 0
for item in list_a:
    print(type(item))
