# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с
# новой строки. Строки необходимо пронумеровать.
#  Если в слово длинное, выводить только первые 10 букв в слове.

words_list = input("Введи слова через пробел: ").split(" ")

for i, word in enumerate(words_list):
    print(f"{i+1}. {word[:10]}")
